1.#include 的顺序以及尖叫括号< >和双引号" "的区别；
    尖叫括号<>表示编译器只在系统默认目录或者尖括号内的工作目录下搜索头文件，并不去用户的工作目录下寻找，所以一般尖括号用于包含标准库文件；
    双引号""表示编译器先在用户的工作目录下搜索头文件，如果搜索不到则到系统默认目录下去寻找，所以双引号一般用于包含用户自己编写的头文件；
2.在不使用额外空间的情况下，交换两个数
    1）算术
      int x = 5;
      int y = 10;
      x = x + y;
      y = x - y;
      x = x - y;
    2)异或(相同为0，不同为1)
      int x = 5;
      int y = 10;
      x = x ^ y;    //  只能对 int,char...
      y = x ^ y;    //  于是将x^y的结果赋予x,接着再将x与y异或，此时y的值就是y = x ^ y ^ y = x ^ (y ^ y) = x;
      x = x ^ y;    //  依此x依然是数异或的结果，而y是x原来的值，接着进行x ^ y就等同于x ^ y ^ x = y，于是x就拿到了y原本的值。
      x ^= y ^= x;
      //异或运算的性质：
      @1相同的两个数异或结果为0；
      @2任何数与0异或结果还是其自身；
      @3异或运算满足交换律和结合律;
3.C++操作符的优先级:
    
